LMN-SCUT/NUEDC-2026-Car/controller-stm32/h60-f407-line-car/User/main.c
                /*
                 * 对照模式：
                 * APP_ENCODER_SPEED_PI_ENABLE=0时，灰度左右百分比直接写PWM；
                 * 编码器仍持续测速并参与堵转保护，但不会修正电机输出。
                 * 置1即可恢复灰度外环+四路编码器PI内环，不删除原闭环代码。
                 */
#if APP_ENCODER_SPEED_PI_ENABLE
                SpeedPI_SetSidePercentTargets(
                    LineFollower_LeftTargetPercent(),
                    LineFollower_RightTargetPercent());
                SpeedPI_Update(&encoder_delta);
                {
                    const SpeedPI_Status *speed = SpeedPI_GetStatus();
                    track_target_sum.ma += speed->target_ma;
                    track_target_sum.mb += speed->target_mb;
                    track_target_sum.mc += speed->target_mc;
                    track_target_sum.md += speed->target_md;
                }
#else
                Motor_SetSidePercent(
                    LineFollower_LeftTargetPercent(),
                    LineFollower_RightTargetPercent());
                /*
                 * TA~TD仍按原换算比例累计“等效速度目标”，只用于和EA~ED
                 * 对照；直接PWM模式不会用这些目标闭环调节。
                 */
                track_target_sum.ma +=
                    (int32_t)LineFollower_RightTargetPercent() *
                    (int32_t)SPEED_PI_COUNTS_PER_PERCENT;
                track_target_sum.mb +=
                    (int32_t)LineFollower_LeftTargetPercent() *
                    (int32_t)SPEED_PI_COUNTS_PER_PERCENT;
                track_target_sum.mc +=
                    (int32_t)LineFollower_RightTargetPercent() *
                    (int32_t)SPEED_PI_COUNTS_PER_PERCENT;
                track_target_sum.md +=
                    (int32_t)LineFollower_LeftTargetPercent() *
                    (int32_t)SPEED_PI_COUNTS_PER_PERCENT;
#endif

                if (MotorProtection_Update(Timebase_Millis(),
                                           &encoder_delta)) {
                    send_stall_detail();
                    SpeedPI_Reset();
                    app_state = APP_ERROR;
                    HC05_SendString("STALL_OR_ENCODER_ERROR,STOP\r\n");
                    break;
                }

                if ((uint32_t)(Timebase_Millis() -
                               last_track_report_ms) >=
                    APP_TRACK_REPORT_MS) {
                    last_track_report_ms = Timebase_Millis();
                    send_track_test_frame(&track_encoder_sum,
                                          &track_target_sum,
                                          finish_marker_frames);
                    track_encoder_sum.ma = 0;
                    track_encoder_sum.mb = 0;
                    track_encoder_sum.mc = 0;
                    track_encoder_sum.md = 0;
                    track_target_sum.ma = 0;
                    track_target_sum.mb = 0;
                    track_target_sum.mc = 0;
                    track_target_sum.md = 0;
                }
                break;

            case APP_FINISHED:
                Motor_Brake();
                if ((uint32_t)(Timebase_Millis() -
                               last_track_report_ms) >= 1000U) {
                    last_track_report_ms = Timebase_Millis();
                    HC05_SendString("STATE,FINISHED,MS=");
                    HC05_SendInt32((int32_t)run_time_ms);
                    HC05_SendString("\r\n");
                }
                break;

            case APP_ERROR:
            default:
                SpeedPI_Reset();
                if ((uint32_t)(Timebase_Millis() -
                               last_track_report_ms) >= 1000U) {
                    last_track_report_ms = Timebase_Millis();
                    HC05_SendString("STATE,ERROR,ON=");
                    HC05_SendInt32((int32_t)gray_i2c_online);
                    HC05_SendString(",I2C=");
                    HC05_SendInt32((int32_t)gray_i2c_error);
                    HC05_SendString("\r\n");
                    if (MotorProtection_GetStatus()->stalled_mask != 0U) {
                        send_stall_detail();
                    }
                }
                break;
        }
#endif
    }
}
